
/* AppController */
"BetterZip will only run on macOS 10.10 (Yosemite) or later systems." = "BetterZip będzie działał tylko na macOS 10.10 (Yosemite) lub nowszych wersjach.";
"Quit!" = "Zakończ!";
"Sorry!" = "Przepraszam!";
"https://macitbetter.com/contact" = "mailto:betterzip@macitbetter.com";
"https://macitbetter.com/" = "https://macitbetter.com/";
"http://www.win-rar.com/" = "http://www.win-rar.com/";

/* helpers */
"Last modified: %@\nSize: %@" = "Ostatnia modyfikacja: %@\nRozmiar: %@";

/* ReplaceExistingFiles */
"An item named %@ already exists in this location. Do you want to replace it with the one you are extracting?" = "Rzecz o nazwie %@ już istnieje w tym folderze. Czy chcesz ją zastąpić wypakowaną zawartością?";
"An item named %@ already exists in this location inside the archive. Do you want to replace it with the one you are adding?" = "Rzecz o nazwie %@ istnieje już w tej lokalizacji wewnątrz archiwum. Czy chcesz zastąpić ją rzeczą którą dodajesz?";
"File in archive:" = "Plik w archiwum:";
"File on disc:" = "Plik na dysku:";

/* ZipDocument */
"Zip Format (recommended)" = "Format Zip (zalecany)";
"TAR Format, uncompressed (tar)" = "Format TAR, bez kompresji (tar)";
"TAR Format, GZip compressed (tgz)" = "Format TAR, kompresja GZip (tgz)"; 
"TAR Format, BZip2 compressed (tbz)" = "Format TAR, kompresja BZip2 (tbz)";
"7-Zip Format (best compression)" = "Format 7-Zip (najlepsza kompresja)";
"RAR Format" = "Format RAR";
"Extract All" = "Wypakuj wszystkie";
"Extract all files and folders from the archive" = "Wypakuj wszystkie pliki i foldery z archiwum";
"Extract" = "Wypakuj";
"Extract the selected files or folders from the archive" = "Wypakuj wybrane pliki lub foldery z archiwum";
"Extracting archive: %@" = "Wypakowuję archiwum: %@";
"Opening archive with %d items. Ugh, this is going to take a while..." = "Otwieram archiwum z %d rzeczami. To może chwilę potrwać...";
"Opening archive with %d items" = "Otwieram archiwum z %d rzeczami";
"Check for updates on startup?" = "Sprawdzać aktualizacje podczas startu?";
"Would you like %@ to check for updates on startup? You can initiate the check manually from the preferences window at any time." = "Czy chcesz %@ sprawdzać aktualizacje podczas startu? Możesz zainicjować sprawdzanie ręcznie z okna preferencji.";
"Yes" = "Tak";
"No" = "Nie";
"Are you sure you want to overwrite the original archive?" = "Czy na pewno chcesz zastąpić oryginalne archiwum?";
"Warning: Saving cannot be undone" = "Ostrzeżenie: Zapisywanie nie może być cofnięte";
"Save" = "Zapisz";
"Don't Save" = "Nie zapisuj";
"Saving archive: %@ of %@" = "Zapisuję archiwum: %@ z %@";
"Extracting items from archive: %@ of %@" = "Wypakowuję rzeczy z archiwum: %@ z %@";
"Add" = "Dodaj";
"Open" = "Otwórz";
"Add Items" = "Dodaj rzeczy";
"Extract Here" = "Wypakuj tutaj";
"Warning" = "Ostrzeżenie";
"%@ is not handled by any application. Try to extract the file and use Finder to open it." = "%@ nie jest obsługiwany przez żadną aplikację. Spróbuj wypakować plik i użyj Findera, aby go otworzyć.";
"OK" = "OK";
"Delete Items" = "Usuń rzeczy";
"You can't move an item into one of its subfolders!" = "Nie możesz przenieść rzeczy do jednego z podfolderów!";
"Move Items" = "Przenieś rzeczy";
"BetterZip will now remove Mac specific files from the archive." = "BetterZip usunie teraz pliki systemowe Mac z archiwum.";
"Clean now" = "Wyczyść teraz";
"Cancel" = "Anuluj";
"Clean Archive" = "Wyczyść archiwum";
"Change Archive Mode" = "Zmień tryb archiwum";
"Archive" = "Archiwum";
"Add to %@..." = "Dodaj do %@...";
"Extract All..." = "Wypakuj wszystkie...";
"Extract Selected..." = "Wypakuj wybrane...";
"Save the archive" = "Zapisz archiwum";
"Add a new file or folder to the archive" = "Dodaj nowy plik lub folder do archiwum";
"Extract files or folders from the archive" = "Wypakuj pliki lub foldery z archiwum";
"View" = "Podejrzyj";
"View the selected file" = "Podejrzyj wybrany plik";
"Delete" = "Usuń";
"Delete the selected files or folders from the archive" = "Usuń wybrane pliki lub foldery z archiwum";
"Search" = "Znajdź";
"Search the archive file" = "Przeszukaj plik archiwum";
"Clean" = "Wyczyść";
"Stop" = "Zakończ";
"Ignore and go on" = "Ignoruj i idź dalej";
"The file %@ could not be added to the archive. Maybe the system disc is full?" = "Plik %@ nie może być dodany do archiwum. Może dysk systemowy jest pełny?";
"There is not enough free space on the destination drive." = "Za mało wolnego miejsca na dysku docelowym.";
"Loading archive: %@" = "Ładuję archiwum: %@";
"External command returned: %d\n" = "Polecenie zewnętrzne zwrócone: %d\n";
"Saving archive failed" = "Zapisywanie archiwum nie powiodło się";
"You don't have permission to write to this folder." = "Nie masz uprawnień do zapisu w tym folderze.";
"An unknown error occurred." = "Wystąpił nieznany błąd.";
"New Folder" = "Nowy folder";
"Create New Folder" = "Utwórz nowy folder";
"Error" = "Błąd";
"Create a new folder in the selected place inside the archive." = "Utwórz nowy folder w wybranym miejscu wewnątrz archiwum.";
"An item with this name already exists in this folder!" = "Rzecz o tej nazwie już istnieje w tym folderze!";
"Do you want to save the changes you made in the document %@?" = "Czy chcesz zapisać zmiany w dokumencie %@?";
"Your changes will be lost if you don't save them." = "Wprowadzone zmiany zostaną utracone jeśli ich nie zapiszesz.";
"The archive extraction failed." = "Wypakowanie archiwum nie powiodło się.";
"Maybe, there is not enough free space on the destination drive. Or the password is incorrect." = "Być może, nie ma wystarczającej ilości miejsca na dysku docelowym. Lub hasło jest nieprawidłowe.";
"Rename Item" = "Zmień nazwę rzeczy";
"Opening archive failed" = "Otwarcie archiwum nie powiodło się";
"Not encrypted" = "Bez szyfrowania";
"Weak (PKZip2 compatible)" = "Słaba (kompatybilna PKZip2)";
"Strong (AES-256)" = "Mocna (AES-256)";
"untitled folder" = "folder bez nazwy";
"BetterZip Temporary Folder" = "Folder tymczasowy BetterZip"; 
"(incl. %d hidden)" = "(pliki ukryte %d )";
"%d selected, uncompressed size: %@ %@" = "wybrano %d , rozmiar bez kompresji: %@ %@";
"%d items, uncompressed size: %@ %@" = "%d rzeczy, rozmiar bez kompresji: %@ %@";
"%d item, uncompressed size: %@ %@" = "%d rzecz, rozmiar bez kompresji: %@ %@";
"BetterZip will now remove one file matching the patterns configured in the preferences window from the archive." = "BetterZip usunie teraz jeden plik pasujący do szablonu skonfigurowanego w preferencjach.";
"BetterZip will now remove %d files matching the patterns configured in the preferences window from the archive." = "BetterZip usunie teraz %d pliki pasujące do szablonów skonfigurowanych w preferencjach.";
"BetterZip will now remove one Mac specific file from the archive." = "BetterZip usunie teraz jeden plik systemowy Mac z archiwum.";
"BetterZip will now remove %d Mac specific files from the archive." = "BetterZip usunie teraz %d pliki systemowe Mac z archiwum.";
"Remove" = "Usuń";
"BetterZip cannot extract to this folder. Maybe you don't have write access." = "BetterZip nie może wypakować do tego folderu. Może nie masz dostępu do zapisu.";
"Save As..." = "Zapisz jako...";
"Save the archive with another name." = "Zapisz archiwum pod inną nazwą.";
"Cleaning" = "Czyszczenie";
"No compression" = "Bez kompresji"; 
"Fast, but larger archives" = "Szybka, ale większe archiwum";
"Normal" = "Normalna";
"Best, but slower operation" = "Najlepsza, ale wolniejsza";
"Remove files matching the patterns configured in the preferences window from the archive." = "Usuń pliki pasujące do szablonów skonfigurowanych w preferencjach.";
"File Types" = "Typy plików";
"N/A" = "N/A";
"Multiple files" = "Wiele plików";
"No files selected" = "Nie wybrano plików";
"A volume is missing: /%s." = "Brak woluminu: /%s.";
"Close" = "Zamknij";
"Strong (AES-256) with header encryption" = "Mocna (AES-256) z szyfrowaniem nazw plików";


/* PreferenceController */
"Last checked: " = "Ostatnie sprawdzenie: ";
"General" = "Ogólne";
"Columns" = "Kolumny";
"Advanced" = "Zaawansowane";
"Helpers" = "Dodatki";
"Use RAR" = "Użyj RAR";
"Never" = "Nigdy";
"never" = "nigdy";
"Next to original" = "Obok oryginału";


/* V 2.0 */
"Cancel the operation" = "Anuluj operację";
"Reveal in Finder" = "Pokaż w Finderze";
"Passwords" = "Hasła";
"no errors" = "nie ma błędów";
"with errors" = "z błędami";
"cancelled" = "anulowano";
"Extracted %@" = "Wypakowano %@";
"Extracting %@" = "Wypakowuję %@";
"Compressing %@" = "Kompresuję %@";
"Extracting items temporarily" = "Wypakowuję rzeczy tymczasowo";
"%@ of %@" = "%@ z %@";
"%@ copy" = "kopiowanie %@";
"Extract to..." = "Wypakuj do...";
"The archive could not be extracted completely. It may be damaged." = "Archiwum nie może być całkowicie wypakowane. Być może jest uszkodzone.";
"This archive appears to be damaged." = "To archiwum wydaje się być uszkodzone.";
"The archive could not be extracted." = "Archiwum nie może być wypakowane.";
"It is either damaged or in an unsupported format." = "To jest uszkodzone albo w nieobsługiwanym formacie.";
"BetterZip Recovered Files" = "BetterZip odzyskał pliki";
"Multiple Copies Installed" = "Zainstalowano wiele kopii";
"Quit and Reveal in Finder" = "Wyjdź i pokaż w Finderze";
"Queued for extraction" = "Przygotowanie do wypakowania";
"Queued for compression" = "Przygotowanie do kompresowania";
"The archive tests failed." = "Test archiwum zakończony niepowodzeniem.";
"The archive is either damaged or in an unsupported format." = "Archiwum jest uszkodzone albo w nieobsługiwanym formacie.";
"Test" = "Testuj";
"Testing: %@\n" = "Testuję: %@\n";
"Test the archive" = "Testuj archiwum";
"Running script" = "Uruchamiam skrypt";
"Show Favorites" = "Pokaż ulubione";
"Hide Favorites" = "Ukryj ulubione";
"Show Preview" = "Pokaż podgląd";
"Hide Preview" = "Ukryj podgląd";
"<new password>" = "<nowe hasło>";
"The transcript window may contain further details." = "Okno aktywność  może zawierać dalsze szczegóły.";
"The file %@ has been modified." = "Plik %@ został zmodyfikowany.";
"Do you want to save the changes back to the archive?" = "Czy chcesz zapisać zmiany z powrotem do archiwum?";
"Update File" = "Aktualizacja pliku";
"Ignore Changes" = "Ignoruj zmiany";
"Ignore This Time" = "Ignoruj tym czasem";
"Symbolic Link (no preview possible)" = "Link symboliczny (brak podglądu)";
"Use for subsequent archives" = "Wykorzystaj dla kolejnych archiwów";
"Use this password for the new archive" = "Użyj tego hasła dla nowego archiwum";
"This is not the password you are looking for." = "Błędne hasło.";
"Edit Presets..." = "Edytuj profile...";
"Show save panel" = "Wybierz lokalizację";
"XAR Format" = "Format XAR";
"Presets" = "Profile";
"Testing archive %@" = "Testuję archiwum %@";
"Archive test successful" = "Test archiwum pomyślny";
"The archive test was completed successfully." = "Test archiwum zakończył się powodzeniem.";
"Today" = "Dziś";
"Yesterday" = "Wczoraj";
"Go to the win.rar GmbH web site" = "Idź do strony win.rar GmbH";
"Extracting items from %@" = "Wypakowuję rzeczy z  %@";
"The rar helper could not be found." = "Nie można odnaleźć programu WinRAR.";
"Please set the correct path in Preferences > Helpers or choose a different format for saving." = "Proszę wybrać prawidłową ścieżkę dostępu w preferencjach > Dodatki, lub wybierz inny format archiwum.";
"Merge Folders" = "Łączenie folderów";
"Keep Both" = "Zatrzymaj oba";
"Apply to all folders" = "Zastosuj do wszystkich folderów";
"Apply to all" = "Zastosuj do wszystkich";
"Do you want to extract the %d archives that were found inside the selected folders?" = "Czy chcesz wypakować %d archiwa, które znaleziono wewnątrz wybranych folderów?";
"To ignore the selected folders and only extract directly selected archives click “Extract Selected Only”." = "Aby zignorować wybrane foldery i wypakować tylko wybrane archiwa kliknij “Wypakuj tylko wybrane”.";
"Extract Selected Only" = "Wypakuj tylko wybrane";
"Archive Creation Complete" = "Tworzenie archiwum zakończone";
"Archive Extraction Complete" = "Wypakowanie archiwum zakończone";
"All Queued Archive Operations Complete" = "Wszystkie operacje ukończone";
"<new preset>" = "<nowy profil>";
"Other folder..." = "Inny folder...";
/* open with other application */
"Other..." = "Inny...";
"Compress" = "Kompresja";
"Saving archive %@" = "Zachowuję archiwum %@";
"Compressed %@" = "Skompresowano %@";
"An error occurred" = "Wystąpił błąd";
"Use this preset as default in the toolbar" = "Użyj te ustawienia jako domyślne w pasku narzędzi";
"Use this preset as service" = "Użyj tych ustawień jako usługi";

/* added in BetterZip 3 */
"Adding files to archive %@" = "Dodawanie plików do archiwum %@";
"When in Direct Mode, all archive operations are immediate and cannot be undone." = "Podczas pracy w trybie bezpośrednim, wszystkie operacje nad archiwami są natychmiastowe i nie można cofnąć.";

/* the two possible labels of the action button in the "file replace" alert panel */
"Update" = "Aktualizacja";
"Replace" = "Zastąp";

"An item named %@ already exists in this location inside the archive. Do you want to update it?" = "Element o nazwie %@ już istnieje w tym miejscu wewnątrz archiwum. Czy chcesz go zaktualizować?";

"The archive cannot be created." = "Archiwum nie może być utworzone.";
"BetterZip will now remove one file matching your patterns from the archive." = "BetterZip usunie teraz jeden plik pasujący do wzoru z archiwum.";
"BetterZip will now remove %d files matching your patterns from the archive." = "BetterZip usunie teraz %d pliki pasujące do wzorców z archiwum.";
"After filtering, there are no files left to archive." = "Po filtracji, nie ma żadnych plików do zostawienia w archiwum.";
"macOS returned this error:" = "macOS pokazał ten błąd:";
"Use this pattern to specify which files and folders to add to the archive:" = "Użyj tego szablonu, aby określić, które pliki i foldery dodać do archiwum:";
"Add Files to Archive" = "Dodaj pliki do archiwum";
"Use this pattern to delete files and folders from the archive:" = "Użyj tego szablonu, aby usunąć pliki i foldery z archiwum:";
"Delete Files From Archive" = "Usuń pliki z archiwum";

/* displayed in the file types table for user defined extensions */
"<Click to add your own>" = "<Kliknij, aby dodać własny>";

/* new compression levels */
"High, but slower operation" = "Wysoki, ale powolnie";
"Best (solid, slow extraction)" = "Najlepsza (powolne wypakowywanie)";

/* Preferences window - name of the tab to manage filter patterns */
"Filtering" = "Filtracja";

/* Tooltip for the delete with pattern toolbar button */
"Delete with pattern" = "Usuń z szablonem";

"<new pattern>" = "<nowa wartość>";

/* warning when a user adds an archive comment, but the current format doesn’t support that (user can still save with an other format */
"You should save this archive with ZIP or RAR format or your comment will be lost." = "Zapisz archiwum w formacie ZIP lub RAR bo inaczej komentarz zostanie utracony.";

/* possible button labels for setting and clearing passwords in the save presets configuration */
"Set" = "Ustaw";
"Clear" = "Wyczyść";

"CPIO Format, uncompressed (cpio)" = "Format CPIO, bez kompresji (cpio)";
"TAR Format, xz compressed (txz)" = "Format TAR, kompresja xz (txz)";

/* title of the OK button in the file open panel used to locate the temp folder or standard opening program */ 
"Use" = "Wybierz plik";

/* possible file status strings */
"Modified" = "Zmodyfikowano";
"Moved" = "Przeniesiono";
"Added" = "Dodano";
"Updated" = "Zaktualizowano";

"An error occurred opening %@. Do you want to try to open the archive anyway?" = "Wystąpił błąd podczas otwierania %@. Czy mimo to chcesz spróbować otworzyć archiwum?";
"Cancel Opening" = "Anuluj otwieranie";
"Open Anyway" = "Mimo to otwórz";

/* added in BetterZip 4 */

/* Default title for dynamic preset services */
"Compress with Preset %@" = "Kompresuj z profilem %@";
"Extract with Preset %@" = "Wypakuj z profilem %@";
"Service Name" = "Nazwa serwisu";
"Comment Text" = "Tekst komentarza";

"Caution" = "Uwaga";
"Do not enable this option, if you are not in the habit of making regular backups of your data. BetterZip will not warn you before overwriting files, if you use a preset with the overwrite switch enabled. Files can be lost. Use at your own risk." = "Nie włączaj tej opcji, jeśli nie masz nawyku regularnego tworzenia kopii zapasowych swoich danych. BetterZip nie ostrzeże cię przed nadpisaniem plików, jeśli użyjesz profilu z włączonym przełącznikiem nadpisywania. Pliki mogą zostać utracone. Używasz na własne ryzyko.";
"Activate" = "Aktywuj";
"Trash" = "Kosz";
"Don't move" = "Nie ruszaj";
"+pwd" = "+pwd";
"Reload Drop Bar" = "Załaduj ponownie Drop Bar";

"The file %@ could not be extracted. %@\n\nThe last error macOS reported was:\n\"%s\"" = "Plik %@ nie mógł zostać wypakowany. %@\n\nOstatni błąd zgłoszony przez macOS:\n\"%s\"";
"The password may be incorrect." = "Hasło może być nieprawidłowe.";
"Archive Extraction Failed" = "Nie udało się wypakować archiwum";
"Archive Creation Failed" = "Tworzenie archiwum zakończone niepowodzeniem";
"Archive Test Successful" = "Test archiwum zakończony pomyślnie";
"Archive Test Failed" = "Test archiwum zakończony niepowodzeniem";

"The archive disappeared" = "Archiwum zniknęło";
"You can still browse the contents, but all archive operations will fail. \nDo you want to close the window?" = "Nadal możesz przeglądać zawartość, ale wszystkie operacje archiwizacji zakończą się niepowodzeniem.\nCzy chcesz zamknąć to okno?";
"Ignore" = "Ignoruj";

"An error occurred opening %@. Do you want to try to repair the archive?" = "Wystąpił błąd podczas otwierania archiwum %@. Czy chcesz spróbować naprawić to archiwum?";
"The archive could not be extracted completely. It may be damaged. Do you want to try to repair the archive?" = "Nie można całkowicie wypakować archiwum. Może być uszkodzone. Czy chcesz spróbować naprawić to archiwum?";
"Repair" = "Napraw";
"%@ (damaged)" = "%@ (uszkodzony)";

"Drag items here to compress or extract" = "Przeciągnij tutaj, aby skompresować lub wypakować";
"Drop archives here to extract" = "Upuść archiwa tutaj, aby wypakować";
"Drop the archives here to open them" = "Upuść archiwa tutaj, aby je otworzyć";
"Drop items here to compress" = "Upuść pliki tutaj, aby skompresować";
"Drop the files here to add them to a new archive" = "Upuść pliki tutaj, aby dodać je do nowego archiwum";
"Choose from your favorite presets" = "Wybierz spośród swoich ulubionych ustawień";
"Test the archive integrity" = "Testuj integralność archiwum";
"Open and browse the archive" = "Otwórz i przeglądaj archiwum";
"Add the items to a new archive" = "Dodaj elementy do nowego archiwum";
"Trash" = "Kosz";

"Compress with BetterZip" = "Kompresuj w BetterZip";
"Extract with BetterZip" = "Wypakuj w BetterZip";

"Reveal in Finder" = "Pokaż w Finderze";
"Cancel the operation" = "Anuluj operację";

"This archive doesn't contain any Mac specific files yet" = "To archiwum nie zawiera jeszcze żadnych specyficznych plików Mac";
"Do you want to keep it that way or add metadata to your archive?" = "Czy chcesz zachować to w ten sposób lub dodać metadane do swojego archiwum?";
"Add Mac Stuff" = "Dodaj Mac Stuff";
"Keep Mac Stuff out" = "Keep Mac Stuff out";

"System Default" = "Domyślne ustawienie systemowe";
"One password per line:" = "Jedno hasło na linię:";
"Back" = "Wstecz";
"Unlock Password Manager…" = "Odblokuj menadżera haseł…";
"Lock Password Manager" = "Zablokuj menadżera haseł";
"Archives" = "Archiwa";
"Archive Types" = "Typy archiwów";
"Files" = "Pliki";
"Next to archive" = "Obok archiwum";
"Choose Master Password" = "Wybierz hasło główne";
